In [56]:
import pandas as pd
from datetime import datetime
from datetime import date

In [46]:
df = pd.read_csv('Data/bank_transactions.csv',usecols=['CustomerID','CustomerDOB','CustGender','CustLocation','CustAccountBalance'])

In [47]:
df['CustomerDOB']= pd.to_datetime(df['CustomerDOB'])

In [48]:
df.drop(df[(df['CustomerDOB'] == '1800-1-1')].index, inplace = True)

In [49]:
df=df.dropna()

In [57]:
def age(birthdate):
    today = date.today()
    one_or_zero = ((today.month, today.day) < (birthdate.month, birthdate.day))
    year_difference = today.year - birthdate.year
    age = year_difference - one_or_zero
    return age

In [58]:
df["CustomerDOB"] = df['CustomerDOB'].apply(age)

In [59]:
df.drop(df[(df['CustomerDOB'] < 16)].index, inplace = True)

In [60]:
df['CustGender']=df['CustGender'].apply(lambda x: 1 if (x=='M') else 0)

In [61]:
df

        CustomerID  CustomerDOB  CustGender   CustLocation  CustAccountBalance
0         C5841053           28           0     JAMSHEDPUR            17819.05
2         C4417068           26           0         MUMBAI            17874.44
3         C5342380           49           0         MUMBAI           866503.21
4         C9031234           34           0    NAVI MUMBAI             6714.43
5         C1536588           50           0       ITANAGAR            53609.20
...            ...          ...         ...            ...                 ...
1048562   C8020229           32           0      NEW DELHI             7635.19
1048563   C6459278           30           0         NASHIK            27311.42
1048564   C6412354           33           0      HYDERABAD           221757.06
1048565   C6420483           44           0  VISAKHAPATNAM            10117.87
1048566   C8337524           38           0           PUNE            75734.42

[910376 rows x 5 columns]